team/case3/ad-pimple/0/original/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet      
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    outlet      
    {
        type            zeroGradient;
    }   
    fixedWalls      
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    front    
    {
        type            empty;
    }
    back
    {
	type 		empty;
    }
    axis
    {
	type		empty;
    }
}

// ************************************************************************* //
