team/case3/ad-pimple/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
    (0 0 0)      //0
    (2 0 0)      //1
    (4 0 0)      //2
    (0 1 0)      //3
    (2 1 0)      //4
    (4 1 0)      //5
    (8 1 0)      //6
    (2 2 0)      //7
    (4 2 0)      //8
    (8 2 0)      //9
    (0 0 0.1)      //10
    (2 0 0.1)      //11
    (4 0 0.1)      //12
    (0 1 0.1)      //13
    (2 1 0.1)      //14
    (4 1 0.1)      //15
    (8 1 0.1)      //16
    (2 2 0.1)      //17
    (4 2 0.1)      //18
    (8 2 0.1)      //19
);

blocks
(
    hex (0 1 4 3 10 11 14 13) (15 20 1) simpleGrading (1 1 1)
    hex (1 2 5 4 11 12 15 14) (25 20 1) edgeGrading (0.3207709 0.3207709 0.3207709 0.3207709 1 0.5 0.5 1 1 1 1 1)
    hex (4 5 8 7 14 15 18 17) (25 20 1) edgeGrading (0.3207709 0.3207709 0.3207709 0.3207709 0.25 2 2 0.25 1 1 1 1)
    hex (5 6 9 8 15 16 19 18) (30 20 1) edgeGrading (7.00825 7.00825 7.00825 7.00825 2 0.25 0.25 2 1 1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 10 13 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (6 9 19 16)
        );
    }
    upperWall
    {
        type wall;
        faces
        (
            (4 3 13 14)
            (7 4 14 17)
	    (8 7 17 18)
	    (9 8 18 19)
        );
    }
    lowerWall
    {
        type wall;
	faces
	(
	 (0 1 11 10)
	 (1 2 12 11)
	 (2 5 15 12)
	 (5 6 16 15)
	);
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
